
import Image from 'next/image';
import HomeImg from "@/assets/images/detailPage/Home-pic.png";
import HomeRentInfo from './HomerentInfo';

export default function DescribeHome (){
    
   
    return (
         <>
           <div  className=" w-full flex flex-wrap gap-10 ">
        
             <p className=''>
               لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
                چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، 
                و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                 کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان
                 را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
                 ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،
                 در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها،
                 و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، 
                و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. 
             </p>
              <div className='flex flex-wrap w-[400px]  gap-2'>
                <h1 className='w-full text-start font-bold text-[15px]'> امکانات هتل</h1>
                <div className='w-full flex flex-row items-center justify-start gap-2'>
                    
                    <button className='border rounded-[16px] p-1  whitespace-nowrap '>تعداد اتاق : 4 خواب</button>

                    <button className='border rounded-[16px] p-1 whitespace-nowrap '>تعداد اتاق : 4 خواب</button>
                </div>
              </div>

              <h1 className='w-full text-start font-bold text-[15px]'> موقیعت مکانی</h1>
             <Image className='w-full h-[300px] rounded-[16px]' alt='homeImage' src={HomeImg}/>

             <p className=''>
               لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
                چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، 
                و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                 کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان
                 را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
                 ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،
                 در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها،
                 و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، 
                و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. 
             </p>


             <HomeRentInfo/>


          
           </div>
         </>
    )

}